wosayttn/M55M1BSP/_CUnit/usbd/usbd_cunit.c
/*---------------------------------------------------------------------------------------------------------*/
/*                                                                                                         */
/* Copyright (C) 2022 Nuvoton Technology Corp. All rights reserved.                                        */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/
/* File Contents:                                                                                          */
/*   usbd_cunit.c                                                                                          */
/*            The test function of USBD for CUnit.                                                         */
/* Project:   M466                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------------------------------------*/
/* Includes of system headers                                                                              */
/*---------------------------------------------------------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <assert.h>
#include "NuMicro.h"


/*---------------------------------------------------------------------------------------------------------*/
/* Includes of local headers                                                                               */
/*---------------------------------------------------------------------------------------------------------*/
#include "CUnit.h"
#include "Console.h"
#include "usbd_cunit.h"

extern uint8_t g_usbd_SetupPacket[8];

extern unsigned int STATE0;
extern unsigned int STATE1;
extern unsigned int ERR_STATE0;
extern unsigned int ERR_STATE1;
/*---------------------------------------------------------------------------------------------------------*/
/* Test function                                                                                           */
/*---------------------------------------------------------------------------------------------------------*/

int USBD_Tests_Init(void)
{
    return 0;
}
int USBD_Tests_Clean(void)
{
    return 0;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: function_name                                                                                 */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               param - [in/out], parameter_description                                                   */
/*               param - [in/out], parameter_description                                                   */
/*                                                                                                         */
/* Returns:      the_value                                                                                 */
/* Side effects: the_effect                                                                                */
/* Description:                                                                                            */
/*               description                                                                               */
/*---------------------------------------------------------------------------------------------------------*/

CU_SuiteInfo suites[] =
{
    {"USBD MACRO", USBD_Tests_Init, USBD_Tests_Clean, NULL, NULL, USBD_MacroTests},
    {"USBD API", USBD_Tests_Init, USBD_Tests_Clean, NULL, NULL, USBD_ApiTests},
    {"USBD CONSTANT", USBD_Tests_Init, USBD_Tests_Clean, NULL, NULL, USBD_ConstantTest},
    CU_SUITE_INFO_NULL
};



void MACRO_USBD_Maximum()
{
    CU_ASSERT(USBD_Maximum(3, 5) == 5);
    CU_ASSERT(USBD_Maximum(3500, 1500) == 3500);
}

void MACRO_USBD_Minimum()
{
    CU_ASSERT(USBD_Minimum(3, 5) == 3);
    CU_ASSERT(USBD_Minimum(3500, 1500) == 1500);
}

void MACRO_USBD_ENABLE_DISABLE_USB()
{
    CU_ASSERT_FALSE(USBD->ATTR & 0x90);
    USBD_ENABLE_USB();
    CU_ASSERT((USBD->ATTR & 0x90) == (USBD_USB_EN | USBD_PHY_EN));

    USBD_DISABLE_USB();
    CU_ASSERT((USBD->ATTR & 0x90) == 0x10);

    /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
}

void MACRO_USBD_ENABLE_DISABLE_PHY()
{
    CU_ASSERT_FALSE(USBD->ATTR & 0x10);
    USBD_ENABLE_PHY();
    CU_ASSERT((USBD->ATTR & 0x90) == 0x10);
    USBD_DISABLE_PHY();
    CU_ASSERT_FALSE(USBD->ATTR & 0x10);
    /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
}

void MACRO_USBD_SET_CLEAR_SE0()
{
    CU_ASSERT((USBD->SE0 & 1) == USBD_DRVSE0);
    USBD_CLR_SE0();
    CU_ASSERT_FALSE(USBD->SE0 & 1);
    USBD_SET_SE0();
    CU_ASSERT_TRUE(USBD->SE0 & 1);
    /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
}

void MACRO_USBD_SET_GET_ADDR()
{
    CU_ASSERT_FALSE(USBD->FADDR);
    USBD_SET_ADDR(0x55);
    CU_ASSERT((USBD->FADDR & 0x7F) == 0x55);
    CU_ASSERT(USBD_GET_ADDR() == 0x55);
    USBD_SET_ADDR(0xAA);
    CU_ASSERT((USBD->FADDR & 0x7F) == 0x2A);
    CU_ASSERT(USBD_GET_ADDR() == 0x2A);
     /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
}

void MACRO_USBD_ENABLE_INT()
{
    USBD_ENABLE_INT(USBD_INT_SOF);
    CU_ASSERT(USBD->INTEN & 0x10);
    USBD_ENABLE_INT(USBD_INT_WAKEUP);
    CU_ASSERT(USBD->INTEN & 8);
    USBD_ENABLE_INT(USBD_INT_FLDET);
    CU_ASSERT(USBD->INTEN & 4);
    USBD_ENABLE_INT(USBD_INT_USB);
    CU_ASSERT(USBD->INTEN & 2);
    USBD_ENABLE_INT(USBD_INT_BUS);
    CU_ASSERT(USBD->INTEN & 1);
    /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
}

void MACRO_USBD_GET_CLR_INT_FLAG()
{
    CU_ASSERT(USBD_GET_INT_FLAG() == 0);
    USBD_CLR_INT_FLAG(USBD_INTSTS_WAKEUP | USBD_INTSTS_FLDET | USBD_INTSTS_BUS | USBD_INTSTS_USB);
    CU_ASSERT(USBD_GET_INT_FLAG() == 0);
}

void MACRO_USBD_GET_CLR_EP_INT_FLAG()
{
    CU_ASSERT(USBD_GET_EP_INT_FLAG() == 0);
    USBD_CLR_EP_INT_FLAG(0x1FFFFFF);
    CU_ASSERT(USBD_GET_EP_INT_FLAG() == 0);
}

void MACRO_USBD_GET_EP_FLAG()
{
    CU_ASSERT(USBD_GET_EP_FLAG() == 0);
}


void MACRO_USBD_GET_BUS_STATE()
{
    CU_ASSERT(USBD_GET_BUS_STATE() == 0);
}

void MACRO_USBD_IS_ATTACHED()
{
    CU_ASSERT(USBD_IS_ATTACHED() == 0);
}

void MACRO_USBD_STOP_TRANSACTION()
{
    USBD_STOP_TRANSACTION(EP0);
    CU_ASSERT(USBD->EP[0].CFGP == 0);
    USBD_STOP_TRANSACTION(EP1);
    CU_ASSERT(USBD->EP[1].CFGP == 0);
    USBD_STOP_TRANSACTION(EP2);
    CU_ASSERT(USBD->EP[2].CFGP == 0);
    USBD_STOP_TRANSACTION(EP3);
    CU_ASSERT(USBD->EP[3].CFGP == 0);
    USBD_STOP_TRANSACTION(EP4);
    CU_ASSERT(USBD->EP[4].CFGP == 0);
    USBD_STOP_TRANSACTION(EP5);
    CU_ASSERT(USBD->EP[5].CFGP == 0);
    USBD_STOP_TRANSACTION(EP6);
    CU_ASSERT(USBD->EP[6].CFGP == 0);
    USBD_STOP_TRANSACTION(EP7);
    CU_ASSERT(USBD->EP[7].CFGP == 0);
    USBD_STOP_TRANSACTION(EP8);
    CU_ASSERT(USBD->EP[8].CFGP == 0);
    USBD_STOP_TRANSACTION(EP9);
    CU_ASSERT(USBD->EP[9].CFGP == 0);
    USBD_STOP_TRANSACTION(EP10);
    CU_ASSERT(USBD->EP[10].CFGP == 0);
    USBD_STOP_TRANSACTION(EP11);
    CU_ASSERT(USBD->EP[11].CFGP == 0);
    USBD_STOP_TRANSACTION(EP12);
    CU_ASSERT(USBD->EP[12].CFGP == 0);
    USBD_STOP_TRANSACTION(EP13);
    CU_ASSERT(USBD->EP[13].CFGP == 0);
    USBD_STOP_TRANSACTION(EP14);
    CU_ASSERT(USBD->EP[14].CFGP == 0);
    USBD_STOP_TRANSACTION(EP15);
    CU_ASSERT(USBD->EP[15].CFGP == 0);
    USBD_STOP_TRANSACTION(EP16);
    CU_ASSERT(USBD->EP[16].CFGP == 0);
    USBD_STOP_TRANSACTION(EP17);
    CU_ASSERT(USBD->EP[17].CFGP == 0);
    USBD_STOP_TRANSACTION(EP18);
    CU_ASSERT(USBD->EP[18].CFGP == 0);
    USBD_STOP_TRANSACTION(EP19);
    CU_ASSERT(USBD->EP[19].CFGP == 0);
    USBD_STOP_TRANSACTION(EP20);
    CU_ASSERT(USBD->EP[20].CFGP == 0);
    USBD_STOP_TRANSACTION(EP21);
    CU_ASSERT(USBD->EP[21].CFGP == 0);
    USBD_STOP_TRANSACTION(EP22);
    CU_ASSERT(USBD->EP[22].CFGP == 0);
    USBD_STOP_TRANSACTION(EP23);
    CU_ASSERT(USBD->EP[23].CFGP == 0);
    USBD_STOP_TRANSACTION(EP24);
    CU_ASSERT(USBD->EP[24].CFGP == 0);
    /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
}

void MACRO_USBD_SET_DATA0_DATA1()
{
    USBD_SET_DATA1(0);
    CU_ASSERT((USBD->EP[0].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(0);
    CU_ASSERT((USBD->EP[0].CFG & 0x80) == 0);
    USBD_SET_DATA1(1);
    CU_ASSERT((USBD->EP[1].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(1);
    CU_ASSERT((USBD->EP[1].CFG & 0x80) == 0);
    USBD_SET_DATA1(2);
    CU_ASSERT((USBD->EP[2].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(2);
    CU_ASSERT((USBD->EP[2].CFG & 0x80) == 0);
    USBD_SET_DATA1(3);
    CU_ASSERT((USBD->EP[3].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(3);
    CU_ASSERT((USBD->EP[3].CFG & 0x80) == 0);
    USBD_SET_DATA1(4);
    CU_ASSERT((USBD->EP[4].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(4);
    CU_ASSERT((USBD->EP[4].CFG & 0x80) == 0);
    USBD_SET_DATA1(5);
    CU_ASSERT((USBD->EP[5].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(5);
    CU_ASSERT((USBD->EP[5].CFG & 0x80) == 0);
    USBD_SET_DATA1(6);
    CU_ASSERT((USBD->EP[6].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(6);
    CU_ASSERT((USBD->EP[6].CFG & 0x80) == 0);
    USBD_SET_DATA1(7);
    CU_ASSERT((USBD->EP[7].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(7);
    CU_ASSERT((USBD->EP[7].CFG & 0x80) == 0);
    USBD_SET_DATA1(8);
    CU_ASSERT((USBD->EP[8].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(8);
    CU_ASSERT((USBD->EP[8].CFG & 0x80) == 0);
    USBD_SET_DATA1(9);
    CU_ASSERT((USBD->EP[9].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(9);
    CU_ASSERT((USBD->EP[9].CFG & 0x80) == 0);
    USBD_SET_DATA1(10);
    CU_ASSERT((USBD->EP[10].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(10);
    CU_ASSERT((USBD->EP[10].CFG & 0x80) == 0);
    USBD_SET_DATA1(11);
    CU_ASSERT((USBD->EP[11].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(11);
    CU_ASSERT((USBD->EP[11].CFG & 0x80) == 0);
    USBD_SET_DATA1(12);
    CU_ASSERT((USBD->EP[12].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(12);
    CU_ASSERT((USBD->EP[12].CFG & 0x80) == 0);
    USBD_SET_DATA1(13);
    CU_ASSERT((USBD->EP[13].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(13);
    CU_ASSERT((USBD->EP[13].CFG & 0x80) == 0);
    USBD_SET_DATA1(14);
    CU_ASSERT((USBD->EP[14].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(14);
    CU_ASSERT((USBD->EP[14].CFG & 0x80) == 0);
    USBD_SET_DATA1(15);
    CU_ASSERT((USBD->EP[15].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(15);
    CU_ASSERT((USBD->EP[15].CFG & 0x80) == 0);
    USBD_SET_DATA1(16);
    CU_ASSERT((USBD->EP[16].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(16);
    CU_ASSERT((USBD->EP[16].CFG & 0x80) == 0);
    USBD_SET_DATA1(17);
    CU_ASSERT((USBD->EP[17].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(17);
    CU_ASSERT((USBD->EP[17].CFG & 0x80) == 0);
    USBD_SET_DATA1(18);
    CU_ASSERT((USBD->EP[18].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(18);
    CU_ASSERT((USBD->EP[18].CFG & 0x80) == 0);
    USBD_SET_DATA1(19);
    CU_ASSERT((USBD->EP[19].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(19);
    CU_ASSERT((USBD->EP[19].CFG & 0x80) == 0);
    USBD_SET_DATA1(20);
    CU_ASSERT((USBD->EP[20].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(20);
    CU_ASSERT((USBD->EP[20].CFG & 0x80) == 0);
    USBD_SET_DATA1(21);
    CU_ASSERT((USBD->EP[21].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(21);
    CU_ASSERT((USBD->EP[21].CFG & 0x80) == 0);
    USBD_SET_DATA1(22);
    CU_ASSERT((USBD->EP[22].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(22);
    CU_ASSERT((USBD->EP[22].CFG & 0x80) == 0);
    USBD_SET_DATA1(23);
    CU_ASSERT((USBD->EP[23].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(23);
    CU_ASSERT((USBD->EP[23].CFG & 0x80) == 0);
    USBD_SET_DATA1(24);
    CU_ASSERT((USBD->EP[24].CFG & 0x80) == 0x80);
    USBD_SET_DATA0(24);
    CU_ASSERT((USBD->EP[24].CFG & 0x80) == 0);
    /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
}

