wosayttn/M55M1BSP/_CUnit/usbd/usbd_cunit.c
void MACRO_USBD_SET_GET_PAYLOAD_LEN()
{
    uint32_t u32EpNum, u32ReturnValue;

    for(u32EpNum = 0; u32EpNum < USBD_MAX_EP; u32EpNum++)
    {
        USBD_CONFIG_EP(u32EpNum, USBD_CFG_EPMODE_IN);
    }

    for(u32EpNum = 0; u32EpNum < USBD_MAX_EP; u32EpNum++)
    {
        USBD_SET_PAYLOAD_LEN(u32EpNum, 0);
        CU_ASSERT(USBD->EP[u32EpNum].MXPLD == 0);
        u32ReturnValue = USBD_GET_PAYLOAD_LEN(u32EpNum);
        CU_ASSERT(u32ReturnValue == 0);

        USBD_SET_PAYLOAD_LEN(u32EpNum, 0x80);
        CU_ASSERT(USBD->EP[u32EpNum].MXPLD == 0x80);
        u32ReturnValue = USBD_GET_PAYLOAD_LEN(u32EpNum);
        CU_ASSERT(u32ReturnValue == 0x80);

        USBD_SET_PAYLOAD_LEN(u32EpNum, 0x1FF);
        CU_ASSERT(USBD->EP[u32EpNum].MXPLD == 0x1FF);
        u32ReturnValue = USBD_GET_PAYLOAD_LEN(u32EpNum);
        CU_ASSERT(u32ReturnValue == 0x1FF);
    }
    /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
}

void MACRO_USBD_CONFIG_EP()
{
    uint32_t u32EpNum;

    /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
    for(u32EpNum = 0; u32EpNum < USBD_MAX_EP; u32EpNum++)
    {
        CU_ASSERT(USBD->EP[u32EpNum].CFG == USBD_CFG_EPMODE_DISABLE);
        USBD_CONFIG_EP(u32EpNum, USBD_CFG_CSTALL | USBD_CFG_DSQSYNC_Msk | USBD_CFG_EPMODE_OUT | USBD_CFG_TYPE_ISO | 0xF);
        CU_ASSERT(USBD->EP[u32EpNum].CFG == 0x2BF);
    }
    /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
    for(u32EpNum = 0; u32EpNum < USBD_MAX_EP; u32EpNum++)
    {
        CU_ASSERT(USBD->EP[u32EpNum].CFG == USBD_CFG_EPMODE_DISABLE);
        USBD_CONFIG_EP(u32EpNum, USBD_CFG_DB_EN | USBD_CFG_DBTGACTIVE | USBD_CFG_CSTALL | USBD_CFG_DSQSYNC_Msk | USBD_CFG_EPMODE_IN | USBD_CFG_TYPE_ISO | 0xF);
        CU_ASSERT(USBD->EP[u32EpNum].CFG == 0xE5F);
    }
    /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
    for(u32EpNum = 0; u32EpNum < USBD_MAX_EP; u32EpNum++)
    {
        CU_ASSERT(USBD->EP[u32EpNum].CFG == USBD_CFG_EPMODE_DISABLE);
        USBD_CONFIG_EP(u32EpNum, USBD_CFG_DB_EN | USBD_CFG_CSTALL | USBD_CFG_DSQSYNC_Msk | USBD_CFG_EPMODE_OUT | USBD_CFG_TYPE_ISO | 0xF);
        CU_ASSERT(USBD->EP[u32EpNum].CFG == 0xABF);
    }
    /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
    
}

void MACRO_USBD_SET_GET_EP_BUF_ADDR()
{
    uint32_t u32EpNum;

    for(u32EpNum = 0; u32EpNum < USBD_MAX_EP; u32EpNum++)
    {
        USBD_SET_EP_BUF_ADDR(u32EpNum, 0x1F8);
        CU_ASSERT(USBD->EP[u32EpNum].BUFSEG == 0x1F8);
        CU_ASSERT(USBD_GET_EP_BUF_ADDR(u32EpNum) == 0x1F8);
    }
    /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
    
}

void MACRO_USBD_SET_CLR_GET_EP_STALL()
{
    uint32_t u32EpCount;

    for(u32EpCount = 0; u32EpCount < USBD_MAX_EP; u32EpCount++)
    {
        USBD_SET_EP_STALL(u32EpCount);
        CU_ASSERT(USBD->EP[u32EpCount].CFGP == 2);
        CU_ASSERT(USBD->EP[u32EpCount].CFGP == USBD_CFGP_SSTALL);
        CU_ASSERT_TRUE(USBD_GET_EP_STALL(u32EpCount));
        USBD_CLR_EP_STALL(u32EpCount);
        CU_ASSERT(USBD->EP[u32EpCount].CFGP == 0);
        CU_ASSERT_FALSE(USBD_GET_EP_STALL(u32EpCount));
    }
    /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
}

void MACRO_USBD_SET_DB_SB_MODE_IS_DB_MODE()
{
    uint32_t u32EpCount;

    for(u32EpCount = 0; u32EpCount < USBD_MAX_EP; u32EpCount++)
    {
        USBD_SET_DB_MODE(u32EpCount);
        CU_ASSERT(USBD->EP[u32EpCount].CFG == (0x800 | USBD_CFG_DSQSYNC_Msk));
        CU_ASSERT(USBD->EP[u32EpCount].CFG == (USBD_CFG_DB_EN | USBD_CFG_DSQSYNC_Msk));
        CU_ASSERT_TRUE(USBD_IS_DB_MODE(u32EpCount));
        USBD_SET_SB_MODE(u32EpCount);
        CU_ASSERT(USBD->EP[u32EpCount].CFG == (0 | USBD_CFG_DSQSYNC_Msk));
        CU_ASSERT_FALSE(USBD_IS_DB_MODE(u32EpCount));
    }
    /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
}

void MACRO_USBD_SET_DB_ACTIVE_INACTIVE()
{
    uint32_t u32EpCount;

    for(u32EpCount = 0; u32EpCount < USBD_MAX_EP; u32EpCount++)
    {
        USBD_SET_DB_ACTIVE(u32EpCount);
        CU_ASSERT(USBD->EP[u32EpCount].CFG == 0x400);
        CU_ASSERT(USBD->EP[u32EpCount].CFG == USBD_CFG_DBTGACTIVE);
        USBD_SET_DB_INACTIVE(u32EpCount);
        CU_ASSERT(USBD->EP[u32EpCount].CFG == 0);
    }
    /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
}

void MACRO_USBD_MemCopy()
{
    uint8_t u8Src[20];
    uint8_t u8Dest[20];
    uint32_t u32Count;

    for(u32Count = 0; u32Count < 20; u32Count++)
    {
        u8Src[u32Count] = u32Count + 1;
        u8Dest[u32Count] = 0;
    }
    USBD_MemCopy(u8Dest, u8Src, 20);
    for(u32Count = 0; u32Count < 20; u32Count++)
    {
        CU_ASSERT(u8Src[u32Count] == u8Dest[u32Count])
    }
}

void MACRO_USBD_SetStall_ClearStall_GetStall()
{
    USBD->EP[2].CFG = 0xF;
    USBD_SetStall(0xF);
    CU_ASSERT(USBD->EP[2].CFGP == 2);
    CU_ASSERT_TRUE(USBD_GetStall(0xF));

    USBD->EP[7].CFG = 0x2;
    USBD_SetStall(0x2);
    CU_ASSERT(USBD->EP[7].CFGP == 2);
    CU_ASSERT_TRUE(USBD_GetStall(0x2));

    USBD_ClearStall(0xF);
    CU_ASSERT(USBD->EP[2].CFGP == 0);
    CU_ASSERT_FALSE(USBD_GetStall(0xF));

    USBD_ClearStall(0x2);
    CU_ASSERT(USBD->EP[7].CFGP == 0);
    CU_ASSERT_FALSE(USBD_GetStall(0x2));

    /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
}



#define MAX_PACKET_SIZE 20
#define EP0_BUF_OFFSET 0x80
#define EP1_BUF_OFFSET 0x100
#define EP2_BUF_OFFSET 0x180
#define DEVICE_ADDRESS 0x25
#define CONFIGURATION_VALUE 5
#define ALT_INTERFACE 2

/*!<USB Device Descriptor */
uint8_t gu8DeviceDescriptor[] =
{
    LEN_DEVICE,     /* bLength */
    DESC_DEVICE,    /* bDescriptorType */
    0x10, 0x01,     /* bcdUSB */
    0x00,           /* bDeviceClass */
    0x00,           /* bDeviceSubClass */
    0x00,           /* bDeviceProtocol */
    MAX_PACKET_SIZE,   /* bMaxPacketSize0 */
    /* idVendor */
    0x0416 & 0x00FF,
    (0x0416 & 0xFF00) >> 8,
    /* idProduct */
    0x8248 & 0x00FF,
    (0x8248 & 0xFF00) >> 8,
    0x00, 0x00,     /* bcdDevice */
    0x01,           /* iManufacture */
    0x02,           /* iProduct */
    0x03,           /* iSerialNumber */
    0x01            /* bNumConfigurations */
};

/*!<USB HID Report Descriptor */
uint8_t HID_MouseReportDescriptor[] =
{
    0x05, 0x01,     /* Usage Page(Generic Desktop Controls) */
    0x09, 0x02,     /* Usage(Mouse) */
    0xA1, 0x01,     /* Collection(Application) */
    0x09, 0x01,     /* Usage(Pointer) */
    0xA1, 0x00,     /* Collection(Physical) */
    0x05, 0x09,     /* Usage Page(Button) */
    0x19, 0x01,     /* Usage Minimum(0x1) */
    0x29, 0x03,     /* Usage Maximum(0x3) */
    0x15, 0x00,     /* Logical Minimum(0x0) */
    0x25, 0x01,     /* Logical Maximum(0x1) */
    0x75, 0x01,     /* Report Size(0x1) */
    0x95, 0x03,     /* Report Count(0x3) */
    0x81, 0x02,     /* Input(3 button bit) */
    0x75, 0x05,     /* Report Size(0x5) */
    0x95, 0x01,     /* Report Count(0x1) */
    0x81, 0x01,     /* Input(5 bit padding) */
    0x05, 0x01,     /* Usage Page(Generic Desktop Controls) */
    0x09, 0x30,     /* Usage(X) */
    0x09, 0x31,     /* Usage(Y) */
    0x09, 0x38,     /* Usage(Wheel) */
    0x15, 0x81,     /* Logical Minimum(0x81)(-127) */
    0x25, 0x7F,     /* Logical Maximum(0x7F)(127) */
    0x75, 0x08,     /* Report Size(0x8) */
    0x95, 0x03,     /* Report Count(0x3) */
    0x81, 0x06,     /* Input(1 byte wheel) */
    0xC0,           /* End Collection */
    0xC0            /* End Collection */
};

/* Constant definitions for HID mouse */
#define LEN_CONFIG_AND_SUBORDINATE      (LEN_CONFIG+LEN_INTERFACE+LEN_HID+LEN_ENDPOINT)
#define HID_DEFAULT_INT_IN_INTERVAL     20
#define USBD_SELF_POWERED               0
#define USBD_REMOTE_WAKEUP              0
#define USBD_MAX_POWER                  50  /* The unit is in 2mA. ex: 50 * 2mA = 100mA */
#define INT_IN_EP_NUM   0x01    /* Define the interrupt In EP number */
#define EP2_MAX_PKT_SIZE    8
/* USB HID Interface Class protocol */
#define HID_NONE            0x00
#define HID_KEYBOARD        0x01
#define HID_MOUSE           0x02

/*!<USB Configuration Descriptor for HID */
const uint8_t gu8ConfigDescriptorHID[] =
{
    LEN_CONFIG,     /* bLength */
    DESC_CONFIG,    /* bDescriptorType */
    /* wTotalLength */
    LEN_CONFIG_AND_SUBORDINATE & 0x00FF,
    (LEN_CONFIG_AND_SUBORDINATE & 0xFF00) >> 8,
    0x01,           /* bNumInterfaces */
    0x01,           /* bConfigurationValue */
    0x00,           /* iConfiguration */
    0x80 | (USBD_SELF_POWERED << 6) | (USBD_REMOTE_WAKEUP << 5),/* bmAttributes */
    USBD_MAX_POWER,         /* MaxPower */

    /* I/F descr: HID */
    LEN_INTERFACE,  /* bLength */
    DESC_INTERFACE, /* bDescriptorType */
    0x00,           /* bInterfaceNumber */
    0x00,           /* bAlternateSetting */
    0x01,           /* bNumEndpoints */
    0x03,           /* bInterfaceClass */
    0x01,           /* bInterfaceSubClass */
    HID_MOUSE,      /* bInterfaceProtocol */
    0x00,           /* iInterface */

    /* HID Descriptor */
    LEN_HID,        /* Size of this descriptor in UINT8s. */
    DESC_HID,       /* HID descriptor type. */
    0x10, 0x01,     /* HID Class Spec. release number. */
    0x00,           /* H/W target country. */
    0x01,           /* Number of HID class descriptors to follow. */
    DESC_HID_RPT,   /* Descriptor type. */
    /* Total length of report descriptor. */
    sizeof(HID_MouseReportDescriptor) & 0x00FF,
    (sizeof(HID_MouseReportDescriptor) & 0xFF00) >> 8,

    /* EP Descriptor: interrupt in. */
    LEN_ENDPOINT,   /* bLength */
    DESC_ENDPOINT,  /* bDescriptorType */
    (INT_IN_EP_NUM | EP_INPUT), /* bEndpointAddress */
    EP_INT,         /* bmAttributes */
    /* wMaxPacketSize */
    EP2_MAX_PKT_SIZE & 0x00FF,
    (EP2_MAX_PKT_SIZE & 0xFF00) >> 8,
    HID_DEFAULT_INT_IN_INTERVAL     /* bInterval */
};

