wosayttn/M55M1BSP/_CUnit/usbd/usbd_cunit.c
/*!<USB Configuration Descriptor for MSC */
uint8_t gu8ConfigDescriptorMSC[] =
{
    LEN_CONFIG,                                         // bLength
    DESC_CONFIG,                                        // bDescriptorType
    (LEN_CONFIG + LEN_INTERFACE + LEN_ENDPOINT * 2), 0x00, // wTotalLength
    0x01,                                               // bNumInterfaces
    0x01,                                               // bConfigurationValue
    0x00,                                               // iConfiguration
    0xC0,                                               // bmAttributes
    0x32,                                               // MaxPower

    /* const BYTE cbyInterfaceDescriptor[LEN_INTERFACE] = */
    LEN_INTERFACE,  // bLength
    DESC_INTERFACE, // bDescriptorType
    0x00,     // bInterfaceNumber
    0x00,     // bAlternateSetting
    0x02,     // bNumEndpoints
    0x08,     // bInterfaceClass
    0x05,     // bInterfaceSubClass
    0x50,     // bInterfaceProtocol
    0x00,     // iInterface

    /* const BYTE cbyEndpointDescriptor1[LEN_ENDPOINT] = */
    LEN_ENDPOINT,           // bLength
    DESC_ENDPOINT,          // bDescriptorType
    0x82,                   // bEndpointAddress
    EP_BULK,                // bmAttributes
    MAX_PACKET_SIZE, 0x00,  // wMaxPacketSize
    0x00,                   // bInterval

    /* const BYTE cbyEndpointDescriptor2[LEN_ENDPOINT] = */
    LEN_ENDPOINT,           // bLength
    DESC_ENDPOINT,          // bDescriptorType
    0x03,                   // bEndpointAddress
    EP_BULK,                // bmAttributes
    MAX_PACKET_SIZE, 0x00,  // wMaxPacketSize
    0x00                    // bInterval
};

/*!<USB Language String Descriptor */
uint8_t gu8StringLang[4] =
{
    4,              /* bLength */
    DESC_STRING,    /* bDescriptorType */
    0x09, 0x04
};

/*!<USB Vendor String Descriptor */
uint8_t gu8VendorStringDesc[] =
{
    16,
    DESC_STRING,
    'N', 0, 'u', 0, 'v', 0, 'o', 0, 't', 0, 'o', 0, 'n', 0
};

/*!<USB Product String Descriptor */
uint8_t gu8ProductStringDesc[] =
{
    22,             /* bLength          */
    DESC_STRING,    /* bDescriptorType  */
    'U', 0, 'S', 0, 'B', 0, ' ', 0, 'D', 0, 'e', 0, 'v', 0, 'i', 0, 'c', 0, 'e', 0
};

const uint8_t gu8StringSerial[26] =
{
    26,             // bLength
    DESC_STRING,    // bDescriptorType
    'A', 0, '0', 0, '2', 0, '0', 0, '0', 0, '8', 0, '0', 0, '4', 0, '0', 0, '1', 0, '1', 0, '4', 0
};

const uint8_t *gpu8UsbString[4] =
{
    gu8StringLang,         /*!< Pointer for USB Language String Descriptor */
    gu8VendorStringDesc,   /*!< Pointer for USB Vendor String Descriptor   */
    gu8ProductStringDesc,  /*!< Pointer for USB Product String Descriptor  */
    gu8StringSerial
};

const uint8_t *gpu8UsbHidReport[2] =
{
    HID_MouseReportDescriptor,
    NULL
};

const uint32_t gu32UsbHidReportLen[2] =
{
    sizeof(HID_MouseReportDescriptor),
    0
};

const uint32_t gu32ConfigHidDescIdx[2] =
{
    (LEN_CONFIG + LEN_INTERFACE),
    0
};

const S_USBD_INFO_T gsInfo_HID =
{
    (uint8_t *)gu8DeviceDescriptor,
    (uint8_t *)gu8ConfigDescriptorHID,
    (uint8_t **)gpu8UsbString,
    (uint8_t **)gpu8UsbHidReport,
    NULL,
    (uint32_t *)gu32UsbHidReportLen,
    (uint32_t *)gu32ConfigHidDescIdx
};

const S_USBD_INFO_T gsInfo_MSC =
{
    (uint8_t *)gu8DeviceDescriptor,      /*!< Pointer for USB Device Descriptor          */
    (uint8_t *)gu8ConfigDescriptorMSC,   /*!< Pointer for USB Configuration Descriptor   */
    (uint8_t **)gpu8UsbString,            /*!< String Descriptors */
    NULL,
    NULL,
    NULL
};


void API_USBD_Open()
{
    USBD_Open(&gsInfo_MSC, NULL, NULL);
    //CU_ASSERT( g_usbd_CtrlMaxPktSize==20);
#ifdef SUPPORT_LPM
    CU_ASSERT(USBD->ATTR == (0x800 | 0x7D0));
    CU_ASSERT(USBD->ATTR == (USBD_LPMACK | USBD_BYTEM | 0x200 | USBD_DPPU_EN | USBD_USB_EN | 0x40 | USBD_PHY_EN));
#else
    CU_ASSERT(USBD->ATTR == (0x7D0));
    CU_ASSERT(USBD->ATTR == (USBD_BYTEM | 0x200 | USBD_DPPU_EN | USBD_USB_EN | 0x40 | USBD_PHY_EN));
#endif
    CU_ASSERT(USBD->SE0 == 1);
    /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
}

void API_USBD_Start()
{
    USBD_Start();
    CU_ASSERT(USBD->INTEN == 0x010F);
    CU_ASSERT(USBD->SE0 == 0);
    /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
}

void API_USBD_GetSetupPacket()
{
    uint32_t u32Count, u32ErrorCount = 0;
    uint8_t u8Buffer[8];

    for(u32Count = 0; u32Count < 8; u32Count++)
        g_usbd_SetupPacket[u32Count] = u32Count;

    USBD_GetSetupPacket(u8Buffer);

    for(u32Count = 0; u32Count < 8; u32Count++)
    {
        if(g_usbd_SetupPacket[u32Count] != u8Buffer[u32Count])
            u32ErrorCount++;
    }
    CU_ASSERT_EQUAL(u32ErrorCount, 0);
    USBD_SwReset();
}

void API_USBD_ProcessSetupPacket()
{
    uint32_t u32Count, u32ErrorCount = 0;

    USBD_Open(&gsInfo_MSC, NULL, NULL);
    USBD_CONFIG_EP(0, USBD_CFG_EPMODE_IN);
    USBD_CONFIG_EP(1, USBD_CFG_EPMODE_IN); /* Also set Endpoint buffer 1 as IN endpoint for control OUT endpoint. Just for CUnit test. */
    outp32(0x400C0500, EP0_BUF_OFFSET); /* EP[0]->BUFSEG */
    outp32(0x400C0510, EP1_BUF_OFFSET); /* EP[1]->BUFSEG */
    /* EP2 ==> Bulk IN endpoint, device endpoint number 2. */
    USBD_CONFIG_EP(EP2, USBD_CFG_EPMODE_IN | 2);
    /* Buffer range for EP2 */
    USBD_SET_EP_BUF_ADDR(EP2, EP2_BUF_OFFSET);

    /* --- Standard request "SET_ADDRESS" test --- */
    //outp8(0x400C0800, 0x00); /* Host to device; standard request. */
    outp8(USBD_BUF_BASE, 0x00); /* Host to device; standard request. */
    outp8(0x400C0801, 5);    /* SET_ADDRESS */
    outp8(0x400C0802, DEVICE_ADDRESS); /* wValue: USB device address */
    outp8(0x400C0803, 0);
    outp8(0x400C0804, 0); /* wIndex */
    outp8(0x400C0805, 0);
    outp8(0x400C0806, 0); /* wLength */
    outp8(0x400C0807, 0);

    USBD_ProcessSetupPacket();
    CU_ASSERT(USBD->EP[0].CFG & 0x80); /* DATA1 */
    CU_ASSERT(USBD->EP[0].MXPLD == 0);
    USBD_CtrlIn();
    CU_ASSERT(USBD->EP[0].MXPLD == 0);
    CU_ASSERT(USBD->FADDR == DEVICE_ADDRESS);


    /* --- Standard request "SET_CONFIGURATION" test --- */
    outp8(0x400C0800, REQ_STANDARD); /* Host to device; standard request. */
    outp8(0x400C0801, 9);    /* SET_CONFIGURATION */
    outp8(0x400C0802, CONFIGURATION_VALUE); /* wValue: Configuration value */
    outp8(0x400C0803, 0);
    outp8(0x400C0804, 0); /* wIndex */
    outp8(0x400C0805, 0);
    outp8(0x400C0806, 0); /* wLength */
    outp8(0x400C0807, 0);

