wosayttn/M55M1BSP/_CUnit/usbd/usbd_cunit.c
    USBD_ProcessSetupPacket();
    CU_ASSERT(USBD->EP[0].CFG & 0x80); /* DATA1 */
    CU_ASSERT(USBD->EP[0].MXPLD == 0);
    USBD_CtrlIn();
    CU_ASSERT(USBD->EP[0].MXPLD == 0);


    /* --- Standard request "GET_CONFIGURATION" test --- */
    outp8(0x400C0800, 0x80); /* Device to host; standard request. */
    outp8(0x400C0801, 0x8);  /* GET_CONFIGURATION */
    outp8(0x400C0802, 0); /* wValue */
    outp8(0x400C0803, 0);
    outp8(0x400C0804, 0); /* wIndex */
    outp8(0x400C0805, 0);
    outp8(0x400C0806, 0x01); /* wLength */
    outp8(0x400C0807, 0);

    USBD_ProcessSetupPacket();
    CU_ASSERT(USBD->EP[0].CFG & 0x80); /* DATA1 */
    CU_ASSERT(USBD->EP[0].MXPLD == 1);
    CU_ASSERT(inp8(0x400C0800 + EP0_BUF_OFFSET) == CONFIGURATION_VALUE);
    CU_ASSERT(USBD->EP[1].MXPLD == 20); /* MAX_PACKET_SIZE: 20 */
    //CU_ASSERT(USBD->EP[1].MXPLD == 0);

    /* --- Standard request "SET_FEATURE" & "CLEAR_FEATURE" test --- */
    outp8(0x400C0800, 0x00); /* Host to device; standard request. */
    outp8(0x400C0801, 0x3);  /* SET_FEATURE */
    outp8(0x400C0802, FEATURE_ENDPOINT_HALT); /* wValue: ENDPOINT_HALT standard feature selector */
    outp8(0x400C0803, 0);
    outp8(0x400C0804, 2); /* wIndex: device endpoint number 2 (bulk IN) */
    outp8(0x400C0805, 0);
    outp8(0x400C0806, 0x0); /* wLength */
    outp8(0x400C0807, 0);

    USBD_ProcessSetupPacket();
    CU_ASSERT(USBD->EP[2].CFGP & 2); /* SSTALL */
    CU_ASSERT(USBD->EP[0].CFG & 0x80); /* DATA1 */
    CU_ASSERT(USBD->EP[0].MXPLD == 0);

    outp8(0x400C0800, 0x00); /* Host to device; standard request. */
    outp8(0x400C0801, 0x1);  /* CLEAR_FEATURE */
    outp8(0x400C0802, 0); /* wValue: ENDPOINT_HALT standard feature selector */
    outp8(0x400C0803, 0);
    outp8(0x400C0804, 2); /* wIndex: device endpoint number 2 (bulk IN) */
    outp8(0x400C0805, 0);
    outp8(0x400C0806, 0x0); /* wLength */
    outp8(0x400C0807, 0);

    USBD_ProcessSetupPacket();
    CU_ASSERT((USBD->EP[2].CFGP & 2) == 0); /* SSTALL */
    CU_ASSERT(USBD->EP[0].CFG & 0x80); /* DATA1 */
    CU_ASSERT(USBD->EP[0].MXPLD == 0);

    outp8(0x400C0800, 0x00); /* Host to device; standard request. */
    outp8(0x400C0801, 0x3);  /* SET_FEATURE */
    outp8(0x400C0802, FEATURE_DEVICE_REMOTE_WAKEUP); /* wValue: DEVICE_REMOTE_WAKEUP standard feature selector */
    outp8(0x400C0803, 0);
    outp8(0x400C0804, 0); /* wIndex */
    outp8(0x400C0805, 0);
    outp8(0x400C0806, 0x0); /* wLength */
    outp8(0x400C0807, 0);

    USBD_ProcessSetupPacket();
    CU_ASSERT(g_usbd_RemoteWakeupEn == 1);
    CU_ASSERT(USBD->EP[0].CFG & 0x80); /* DATA1 */
    CU_ASSERT(USBD->EP[0].MXPLD == 0);

    outp8(0x400C0800, 0x00); /* Host to device; standard request. */
    outp8(0x400C0801, 0x1);  /* CLEAR_FEATURE */
    outp8(0x400C0802, 1); /* wValue: DEVICE_REMOTE_WAKEUP standard feature selector */
    outp8(0x400C0803, 0);
    outp8(0x400C0804, 0); /* wIndex */
    outp8(0x400C0805, 0);
    outp8(0x400C0806, 0x0); /* wLength */
    outp8(0x400C0807, 0);

    USBD_ProcessSetupPacket();
    CU_ASSERT(g_usbd_RemoteWakeupEn == 0);
    CU_ASSERT(USBD->EP[0].CFG & 0x80); /* DATA1 */
    CU_ASSERT(USBD->EP[0].MXPLD == 0);


    /* --- Standard request "SET_INTERFACE" test --- */
    outp8(0x400C0800, 0x01); /* Host to device; standard request. */
    outp8(0x400C0801, 0xB);  /* SET_INTERFACE */
    outp8(0x400C0802, ALT_INTERFACE); /* wValue: alternate interface setting */
    outp8(0x400C0803, 0);
    outp8(0x400C0804, 0); /* wIndex: interface number */
    outp8(0x400C0805, 0);
    outp8(0x400C0806, 0x0); /* wLength */
    outp8(0x400C0807, 0);

    USBD_ProcessSetupPacket();
    CU_ASSERT(USBD->EP[0].CFG & 0x80); /* DATA1 */
    CU_ASSERT(USBD->EP[0].MXPLD == 0);

    /* --- Standard request "GET_INTERFACE" test --- */
    outp8(0x400C0800, 0x81); /* Device to host; standard request. */
    outp8(0x400C0801, 0xA);  /* GET_INTERFACE */
    outp8(0x400C0802, 0); /* wValue */
    outp8(0x400C0803, 0);
    outp8(0x400C0804, 0); /* wIndex: interface number */
    outp8(0x400C0805, 0);
    outp8(0x400C0806, 0x01); /* wLength */
    outp8(0x400C0807, 0);

    USBD_ProcessSetupPacket();
    CU_ASSERT(USBD->EP[0].CFG & 0x80); /* DATA1 */
    CU_ASSERT(USBD->EP[0].MXPLD == 1);
    CU_ASSERT(inp8(0x400C0800 + EP0_BUF_OFFSET) == ALT_INTERFACE);
    CU_ASSERT(USBD->EP[1].MXPLD == 20); /* MAX_PACKET_SIZE: 20 */


    /* --- Standard request "GET_DESCRIPTOR" test --- */
    outp8(0x400C0800, 0x80); /* Device to host; standard request. */
    outp8(0x400C0801, 0x6);  /* GET_DESCRIPTOR */
    outp8(0x400C0802, 0); /* wValue: descriptor type (high byte) and descriptor index (low byte). */
    outp8(0x400C0803, 1); /* 1: device descriptor */
    outp8(0x400C0804, 0); /* wIndex */
    outp8(0x400C0805, 0);
    outp8(0x400C0806, LEN_DEVICE); /* wLength */
    outp8(0x400C0807, 0);

    USBD_ProcessSetupPacket();
    CU_ASSERT(USBD->EP[0].CFG & 0x80); /* DATA1 */
    CU_ASSERT(USBD->EP[0].MXPLD == LEN_DEVICE);
    /* Check EP0 buffer */
    for(u32Count = 0; u32Count < LEN_DEVICE; u32Count++)
    {
        if(inp8(0x400C0800 + EP0_BUF_OFFSET + u32Count) != gu8DeviceDescriptor[u32Count])
            u32ErrorCount++;
    }
    CU_ASSERT_EQUAL(u32ErrorCount, 0);
    CU_ASSERT(USBD->EP[1].MXPLD == MAX_PACKET_SIZE);

    outp8(0x400C0800, 0x80); /* Device to host; standard request. */
    outp8(0x400C0801, 0x6);  /* GET_DESCRIPTOR */
    outp8(0x400C0802, 0); /* wValue: descriptor type (high byte) and descriptor index (low byte). */
    outp8(0x400C0803, 2); /* 2: configuration descriptor */
    outp8(0x400C0804, 0); /* wIndex */
    outp8(0x400C0805, 0);
    outp8(0x400C0806, LEN_CONFIG + LEN_INTERFACE + LEN_ENDPOINT * 2); /* wLength (9+9+7*2) */
    outp8(0x400C0807, 0);

    USBD_ProcessSetupPacket();
    CU_ASSERT(USBD->EP[0].CFG & 0x80); /* DATA1 */
    CU_ASSERT(USBD->EP[0].MXPLD == MAX_PACKET_SIZE);
    /* Check EP0 buffer */
    for(u32Count = 0; u32Count < MAX_PACKET_SIZE; u32Count++)
    {
        if(inp8(0x400C0800 + EP0_BUF_OFFSET + u32Count) != gu8ConfigDescriptorMSC[u32Count])
            u32ErrorCount++;
    }
    CU_ASSERT_EQUAL(u32ErrorCount, 0);
    CU_ASSERT(USBD->EP[1].MXPLD == MAX_PACKET_SIZE);

    USBD_CtrlIn();
    CU_ASSERT(USBD->EP[0].MXPLD == ((LEN_CONFIG + LEN_INTERFACE + LEN_ENDPOINT * 2) - MAX_PACKET_SIZE));
    /* Check EP0 buffer */
    for(u32Count = 0; u32Count < (LEN_CONFIG + LEN_INTERFACE + LEN_ENDPOINT * 2) - MAX_PACKET_SIZE; u32Count++)
    {
        if(inp8(0x400C0800 + EP0_BUF_OFFSET + u32Count) != gu8ConfigDescriptorMSC[MAX_PACKET_SIZE + u32Count])
            u32ErrorCount++;
    }
    CU_ASSERT_EQUAL(u32ErrorCount, 0);


