wosayttn/M55M1BSP/_CUnit/usbd/usbd_cunit.c
    USBD_Open(&gsInfo_HID, NULL, NULL);
    outp8(0x400C0800, 0x80); /* Device to host; standard request. */
    outp8(0x400C0801, 0x6);  /* GET_DESCRIPTOR */
    outp8(0x400C0802, 0); /* wValue: descriptor type (high byte) and descriptor index (low byte). */
    outp8(0x400C0803, DESC_HID_RPT); /* DESC_HID_RPT (0x22): HID report descriptor */
    outp8(0x400C0804, 0); /* wIndex */
    outp8(0x400C0805, 0);
    outp8(0x400C0806, 52); /* wLength */
    outp8(0x400C0807, 0);

    USBD_ProcessSetupPacket();
    CU_ASSERT(USBD->EP[0].CFG & 0x80); /* DATA1 */
    CU_ASSERT(USBD->EP[0].MXPLD == MAX_PACKET_SIZE);
    /* Check EP0 buffer */
    for(u32Count = 0; u32Count < MAX_PACKET_SIZE; u32Count++)
    {
        if(inp8(0x400C0800 + EP0_BUF_OFFSET + u32Count) != HID_MouseReportDescriptor[u32Count])
            u32ErrorCount++;
    }
    CU_ASSERT_EQUAL(u32ErrorCount, 0);
    CU_ASSERT(USBD->EP[1].MXPLD == MAX_PACKET_SIZE);

    USBD_CtrlIn();
    CU_ASSERT(USBD->EP[0].MXPLD == MAX_PACKET_SIZE);
    /* Check EP0 buffer */
    for(u32Count = 0; u32Count < MAX_PACKET_SIZE; u32Count++)
    {
        if(inp8(0x400C0800 + EP0_BUF_OFFSET + u32Count) != HID_MouseReportDescriptor[MAX_PACKET_SIZE + u32Count])
            u32ErrorCount++;
    }
    CU_ASSERT_EQUAL(u32ErrorCount, 0);

    USBD_CtrlIn();
    CU_ASSERT(USBD->EP[0].MXPLD == (52 - MAX_PACKET_SIZE * 2));
    /* Check EP0 buffer */
    for(u32Count = 0; u32Count < (52 - MAX_PACKET_SIZE * 2); u32Count++)
    {
        if(inp8(0x400C0800 + EP0_BUF_OFFSET + u32Count) != HID_MouseReportDescriptor[MAX_PACKET_SIZE * 2 + u32Count])
            u32ErrorCount++;
    }
    CU_ASSERT_EQUAL(u32ErrorCount, 0);


    USBD_Open(&gsInfo_MSC, NULL, NULL);
    outp8(0x400C0800, 0x80); /* Device to host; standard request. */
    outp8(0x400C0801, 0x6);  /* GET_DESCRIPTOR */
    outp8(0x400C0802, 0); /* wValue: descriptor type (high byte) and descriptor index (low byte). */
    outp8(0x400C0803, 3); /* 3: string descriptor */
    outp8(0x400C0804, 0); /* wIndex */
    outp8(0x400C0805, 0);
    outp8(0x400C0806, 4); /* wLength */
    outp8(0x400C0807, 0);

    USBD_ProcessSetupPacket();
    CU_ASSERT(USBD->EP[0].CFG & 0x80); /* DATA1 */
    CU_ASSERT(USBD->EP[0].MXPLD == 4);
    /* Check EP0 buffer */
    for(u32Count = 0; u32Count < 4; u32Count++)
    {
        if(inp8(0x400C0800 + EP0_BUF_OFFSET + u32Count) != gu8StringLang[u32Count])
            u32ErrorCount++;
    }
    CU_ASSERT_EQUAL(u32ErrorCount, 0);
    CU_ASSERT(USBD->EP[1].MXPLD == MAX_PACKET_SIZE);

    outp8(0x400C0800, 0x80); /* Device to host; standard request. */
    outp8(0x400C0801, 0x6);  /* GET_DESCRIPTOR */
    outp8(0x400C0802, 1); /* wValue: descriptor type (high byte) and descriptor index (low byte). */
    outp8(0x400C0803, 3); /* 3: string descriptor */
    outp8(0x400C0804, 0); /* wIndex */
    outp8(0x400C0805, 0);
    outp8(0x400C0806, 16); /* wLength */
    outp8(0x400C0807, 0);

    USBD_ProcessSetupPacket();
    CU_ASSERT(USBD->EP[0].CFG & 0x80); /* DATA1 */
    CU_ASSERT(USBD->EP[0].MXPLD == 16);
    /* Check EP0 buffer */
    for(u32Count = 0; u32Count < 16; u32Count++)
    {
        if(inp8(0x400C0800 + EP0_BUF_OFFSET + u32Count) != gu8VendorStringDesc[u32Count])
            u32ErrorCount++;
    }
    CU_ASSERT_EQUAL(u32ErrorCount, 0);
    CU_ASSERT(USBD->EP[1].MXPLD == MAX_PACKET_SIZE);

    outp8(0x400C0800, 0x80); /* Device to host; standard request. */
    outp8(0x400C0801, 0x6);  /* GET_DESCRIPTOR */
    outp8(0x400C0802, 2); /* wValue: descriptor type (high byte) and descriptor index (low byte). */
    outp8(0x400C0803, 3); /* 3: string descriptor */
    outp8(0x400C0804, 0); /* wIndex */
    outp8(0x400C0805, 0);
    outp8(0x400C0806, 22); /* wLength */
    outp8(0x400C0807, 0);

    USBD_ProcessSetupPacket();
    CU_ASSERT(USBD->EP[0].CFG & 0x80); /* DATA1 */
    CU_ASSERT(USBD->EP[0].MXPLD == MAX_PACKET_SIZE);
    /* Check EP0 buffer */
    for(u32Count = 0; u32Count < MAX_PACKET_SIZE; u32Count++)
    {
        if(inp8(0x400C0800 + EP0_BUF_OFFSET + u32Count) != gu8ProductStringDesc[u32Count])
            u32ErrorCount++;
    }
    CU_ASSERT_EQUAL(u32ErrorCount, 0);
    CU_ASSERT(USBD->EP[1].MXPLD == MAX_PACKET_SIZE);

    USBD_CtrlIn();
    CU_ASSERT(USBD->EP[0].MXPLD == (gu8ProductStringDesc[0] - MAX_PACKET_SIZE));
    /* Check EP0 buffer */
    for(u32Count = 0; u32Count < gu8ProductStringDesc[0] - MAX_PACKET_SIZE; u32Count++)
    {
        if(inp8(0x400C0800 + EP0_BUF_OFFSET + u32Count) != gu8ProductStringDesc[MAX_PACKET_SIZE + u32Count])
            u32ErrorCount++;
    }
    CU_ASSERT_EQUAL(u32ErrorCount, 0);


    /* --- Standard request "GET_STATUS" test --- */
    outp8(0x400C0800, 0x80); /* Device to host; standard request. */
    outp8(0x400C0801, 0x0);  /* GET_STATUS */
    outp8(0x400C0802, 0); /* wValue */
    outp8(0x400C0803, 0);
    outp8(0x400C0804, 0); /* wIndex: 0 for device */
    outp8(0x400C0805, 0);
    outp8(0x400C0806, 0x2); /* wLength */
    outp8(0x400C0807, 0);

    USBD_ProcessSetupPacket();
    CU_ASSERT(USBD->EP[0].CFG & 0x80); /* DATA1 */
    CU_ASSERT(USBD->EP[0].MXPLD == 2);
    CU_ASSERT(inp8(0x400C0800 + EP0_BUF_OFFSET) == 1);
    CU_ASSERT(inp8(0x400C0800 + EP0_BUF_OFFSET + 1) == 0);
    CU_ASSERT(USBD->EP[1].MXPLD == 20); /* MAX_PACKET_SIZE: 20 */

    outp8(0x400C0800, 0x81); /* Device to host; standard request. */
    outp8(0x400C0801, 0x0);  /* GET_STATUS */
    outp8(0x400C0802, 0); /* wValue */
    outp8(0x400C0803, 0);
    outp8(0x400C0804, 0); /* wIndex: interface number */
    outp8(0x400C0805, 0);
    outp8(0x400C0806, 0x2); /* wLength */
    outp8(0x400C0807, 0);

    USBD_ProcessSetupPacket();
    CU_ASSERT(USBD->EP[0].CFG & 0x80); /* DATA1 */
    CU_ASSERT(USBD->EP[0].MXPLD == 2);
    CU_ASSERT(inp8(0x400C0800 + EP0_BUF_OFFSET) == 0);
    CU_ASSERT(inp8(0x400C0800 + EP0_BUF_OFFSET + 1) == 0);
    CU_ASSERT(USBD->EP[1].MXPLD == 20); /* MAX_PACKET_SIZE: 20 */

    outp8(0x400C0800, 0x82); /* Device to host; standard request. */
    outp8(0x400C0801, 0x0);  /* GET_STATUS */
    outp8(0x400C0802, 0); /* wValue */
    outp8(0x400C0803, 0);
    outp8(0x400C0804, 0); /* wIndex: endpoint number */
    outp8(0x400C0805, 0);
    outp8(0x400C0806, 0x2); /* wLength */
    outp8(0x400C0807, 0);

