wosayttn/M55M1BSP/_CUnit/usbd/usbd_cunit.c
    USBD_ProcessSetupPacket();
    CU_ASSERT(USBD->EP[0].CFG & 0x80); /* DATA1 */
    CU_ASSERT(USBD->EP[0].MXPLD == 2);
    CU_ASSERT(inp8(0x400C0800 + EP0_BUF_OFFSET) == 0);
    CU_ASSERT(inp8(0x400C0800 + EP0_BUF_OFFSET + 1) == 0);
    CU_ASSERT(USBD->EP[1].MXPLD == 20); /* MAX_PACKET_SIZE: 20 */

    outp8(0x400C0800, 0x82); /* Device to host; standard request. */
    outp8(0x400C0801, 0x0);  /* GET_STATUS */
    outp8(0x400C0802, 0); /* wValue */
    outp8(0x400C0803, 0);
    outp8(0x400C0804, 2); /* wIndex: endpoint number */
    outp8(0x400C0805, 0);
    outp8(0x400C0806, 0x2); /* wLength */
    outp8(0x400C0807, 0);
    USBD_SetStall(2);

    //USBD_ProcessSetupPacket();
    /* Get SETUP packet from USB buffer */
    USBD_MemCopy(g_usbd_SetupPacket, (uint8_t *)USBD_BUF_BASE, 8);
    USBD_StandardRequest();
    CU_ASSERT(USBD->EP[0].CFG & 0x80); /* DATA1 */
    CU_ASSERT(USBD->EP[0].MXPLD == 2);
    CU_ASSERT(inp8(0x400C0800 + EP0_BUF_OFFSET) == 1);
    CU_ASSERT(inp8(0x400C0800 + EP0_BUF_OFFSET + 1) == 0);
    CU_ASSERT(USBD->EP[1].MXPLD == 20); /* MAX_PACKET_SIZE: 20 */


    USBD_SwReset();
    /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
}

void API_USBD_CtrlIn()
{
    uint32_t u32Count, u32ErrorCount = 0;
    uint8_t u8CtrlInBuffer[50];

    for(u32Count = 0; u32Count < 50; u32Count++)
        u8CtrlInBuffer[u32Count] = u32Count;

    USBD_Open(&gsInfo_MSC, NULL, NULL);
    USBD_CONFIG_EP(0, USBD_CFG_EPMODE_IN);
    outp32(0x400C0500, 0x100); /* EP[0]->BUFSEG */

    USBD_PrepareCtrlIn(u8CtrlInBuffer, 50);
    CU_ASSERT(USBD->EP[0].CFG & 0x80);
    CU_ASSERT(USBD->EP[0].MXPLD == 20);
    for(u32Count = 0; u32Count < 20; u32Count++)
    {
        if(inp8(0x400C0900 + u32Count) != u32Count)
            u32ErrorCount++;
    }

    USBD_CtrlIn();
    CU_ASSERT(USBD->EP[0].MXPLD == 20);
    for(u32Count = 0; u32Count < 20; u32Count++)
    {
        if(inp8(0x400C0900 + u32Count) != u32Count + 20)
            u32ErrorCount++;
    }

    USBD_CtrlIn();
    CU_ASSERT(USBD->EP[0].MXPLD == 10);
    for(u32Count = 0; u32Count < 10; u32Count++)
    {
        if(inp8(0x400C0900 + u32Count) != u32Count + 40)
            u32ErrorCount++;
    }
    CU_ASSERT_EQUAL(u32ErrorCount, 0);

    for(u32Count = 0; u32Count < 3; u32Count++)
        u8CtrlInBuffer[u32Count] = 0xF | u32Count;

    USBD_PrepareCtrlIn(u8CtrlInBuffer, 3);
    CU_ASSERT(USBD->EP[0].CFG & 0x80);
    CU_ASSERT(USBD->EP[0].MXPLD == 3);
    for(u32Count = 0; u32Count < 3; u32Count++)
    {
        if(inp8(0x400C0900 + u32Count) != (0xF | u32Count))
            u32ErrorCount++;
    }

    USBD_SwReset();
    /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
}

void API_USBD_CtrlOut()
{
    uint32_t u32Count, u32ErrorCount = 0;
    uint8_t u8CtrlOutBuffer[50];

    for(u32Count = 0; u32Count < 50; u32Count++)
        u8CtrlOutBuffer[u32Count] = 0;

    USBD_Open(&gsInfo_MSC, NULL, NULL);
    USBD_CONFIG_EP(1, USBD_CFG_EPMODE_IN);
    outp32(0x400C0510, 0x100); /* EP[1]->BUFSEG */
    USBD_PrepareCtrlOut(u8CtrlOutBuffer, 50);

    for(u32Count = 0; u32Count < 20; u32Count++)
        outp8(0x400C0900 + u32Count, u32Count);
    USBD_CtrlOut();

    for(u32Count = 0; u32Count < 20; u32Count++)
        outp8(0x400C0900 + u32Count, u32Count + 20);
    USBD_CtrlOut();

    outp32(0x400C0514, 10); /* EP[1]->MXPLD */
    for(u32Count = 0; u32Count < 10; u32Count++)
        outp8(0x400C0900 + u32Count, u32Count + 40);
    USBD_CtrlOut();

    for(u32Count = 0; u32Count < 50; u32Count++)
    {
        if(u8CtrlOutBuffer[u32Count] != u32Count)
            u32ErrorCount++;
    }
    CU_ASSERT_EQUAL(u32ErrorCount, 0);

    USBD_SwReset();
    /* Reset USBD */
  SYS_ResetModule(SYS_USBD0RST);
}

void API_USBD_SwReset()
{
    uint32_t u32Count, u32ErrorCount = 0;

    USBD->FADDR = 0x55;

    for(u32Count = 0; u32Count < 8; u32Count++)
        g_usbd_SetupPacket[u32Count] = u32Count;

    USBD_SwReset();

    CU_ASSERT(USBD->FADDR == 0);
    for(u32Count = 0; u32Count < 8; u32Count++)
    {
        if(g_usbd_SetupPacket[u32Count] != 0)
            u32ErrorCount++;
    }
    CU_ASSERT_EQUAL(u32ErrorCount, 0);

    u32ErrorCount = 0;
    for(u32Count = 0; u32Count < 8; u32Count++)
    {
        if((USBD->EP[u32Count].CFG & USBD_CFG_DSQSYNC_Msk) != 0)
            u32ErrorCount++;
    }
    CU_ASSERT_EQUAL(u32ErrorCount, 0);
}

void VendorRequestCB()
{
    __NOP();
}

extern VENDOR_REQ g_usbd_pfnVendorRequest;

void API_USBD_SetVendorRequest()
{
    USBD_SetVendorRequest((VENDOR_REQ)VendorRequestCB);
    CU_ASSERT(g_usbd_pfnVendorRequest == VendorRequestCB);
}


void SetConfigCB()
{
    __NOP();
}

extern SET_CONFIG_CB g_usbd_pfnSetConfigCallback;

void API_USBD_SetConfigCallback()
{
    USBD_SetConfigCallback((SET_CONFIG_CB)SetConfigCB);
    CU_ASSERT(g_usbd_pfnSetConfigCallback == SetConfigCB);
}

extern uint32_t g_u32EpStallLock;
void API_USBD_LockEpStall()
{
    USBD_LockEpStall(0x11);
    CU_ASSERT(g_u32EpStallLock == 0x11);
    USBD_LockEpStall(0x22);
    CU_ASSERT(g_u32EpStallLock == 0x22);
}



void CONST_USBD_Constants()
{
    /* The following standard request types are defined in USB 2.0 specification. */
    CU_ASSERT(REQ_CLASS == 0x20); /* USBD request type check (bmRequestType[6:5]) */
    CU_ASSERT(REQ_VENDOR == 0x40); /* USBD request type check (bmRequestType[6:5]) */

    /* The following standard request codes are defined in USB 2.0 specification. */
    CU_ASSERT(SET_DESCRIPTOR == 7); /* This standard request does not be implemented in USB device driver so far. */
    CU_ASSERT(SYNC_FRAME == 12); /* This standard request does not be implemented in USB device driver so far. */

    /* The following standard USBD descriptor types are defined in USB 2.0 specification. */
    CU_ASSERT(DESC_QUALIFIER == 6);
    CU_ASSERT(DESC_OTHERSPEED == 7);

    /* The length of Smart Card Device Class Descriptor is defined in Smart-Card CCID specification. */
    CU_ASSERT(LEN_CCID == 0x36);

    /* Transfer type constant definition test for bmAttributes field of endpoint descriptor */
    CU_ASSERT(EP_ISO == 1);
    CU_ASSERT(EP_BULK == 2);
    CU_ASSERT(EP_INT == 3);

    /* Direction constant definition test for bEndpointAddress field of endpoint descriptor */
    CU_ASSERT(EP_INPUT == 0x80);
    CU_ASSERT(EP_OUTPUT == 0);

    USBD->INTEN = USBD_WAKEUP_EN;
    CU_ASSERT(USBD->INTEN == 0x100);

