wosayttn/M55M1BSP/_CUnit/usbd/usbd_cunit.c
    /* USB event constant definition test */
    CU_ASSERT(USBD_INTSTS_SETUP == 0x80000000);
    CU_ASSERT(USBD_INTSTS_EP0 == 0x00010000);
    CU_ASSERT(USBD_INTSTS_EP1 == 0x00020000);
    CU_ASSERT(USBD_INTSTS_EP2 == 0x00040000);
    CU_ASSERT(USBD_INTSTS_EP3 == 0x00080000);
    CU_ASSERT(USBD_INTSTS_EP4 == 0x00100000);
    CU_ASSERT(USBD_INTSTS_EP5 == 0x00200000);
    CU_ASSERT(USBD_INTSTS_EP6 == 0x00400000);
    CU_ASSERT(USBD_INTSTS_EP7 == 0x00800000);
    CU_ASSERT(USBD_INTSTS_EP8 == 0x01000000);
    CU_ASSERT(USBD_INTSTS_EP9 == 0x02000000);
    CU_ASSERT(USBD_INTSTS_EP10 == 0x04000000);
    CU_ASSERT(USBD_INTSTS_EP11 == 0x08000000);

    CU_ASSERT(USBD_EPINTSTS_EP0 == 0x00000001);
    CU_ASSERT(USBD_EPINTSTS_EP1 == 0x00000002);
    CU_ASSERT(USBD_EPINTSTS_EP2 == 0x00000004);
    CU_ASSERT(USBD_EPINTSTS_EP3 == 0x00000008);
    CU_ASSERT(USBD_EPINTSTS_EP4 == 0x00000010);
    CU_ASSERT(USBD_EPINTSTS_EP5 == 0x00000020);
    CU_ASSERT(USBD_EPINTSTS_EP6 == 0x00000040);
    CU_ASSERT(USBD_EPINTSTS_EP7 == 0x00000080);
    CU_ASSERT(USBD_EPINTSTS_EP8 == 0x00000100);
    CU_ASSERT(USBD_EPINTSTS_EP9 == 0x00000200);
    CU_ASSERT(USBD_EPINTSTS_EP10 == 0x00000400);
    CU_ASSERT(USBD_EPINTSTS_EP11 == 0x00000800);
    CU_ASSERT(USBD_EPINTSTS_EP12 == 0x00001000);
    CU_ASSERT(USBD_EPINTSTS_EP13 == 0x00002000);
    CU_ASSERT(USBD_EPINTSTS_EP14 == 0x00004000);
    CU_ASSERT(USBD_EPINTSTS_EP15 == 0x00008000);
    CU_ASSERT(USBD_EPINTSTS_EP16 == 0x00010000);
    CU_ASSERT(USBD_EPINTSTS_EP17 == 0x00020000);
    CU_ASSERT(USBD_EPINTSTS_EP18 == 0x00040000);
    CU_ASSERT(USBD_EPINTSTS_EP19 == 0x00080000);
    CU_ASSERT(USBD_EPINTSTS_EP20 == 0x00100000);
    CU_ASSERT(USBD_EPINTSTS_EP21 == 0x00200000);
    CU_ASSERT(USBD_EPINTSTS_EP22 == 0x00400000);
    CU_ASSERT(USBD_EPINTSTS_EP23 == 0x00800000);
    CU_ASSERT(USBD_EPINTSTS_EP24 == 0x01000000);

    /* USBD_ATTR status flag check */
    CU_ASSERT(USBD_STATE_USBRST == 1);
    CU_ASSERT(USBD_STATE_SUSPEND == 2);
    CU_ASSERT(USBD_STATE_RESUME == 4);
    CU_ASSERT(USBD_STATE_TIMEOUT == 8);
    CU_ASSERT(USBD_STATE_L1SUSPEND == 0x1000);
    CU_ASSERT(USBD_STATE_L1RESUME == 0x2000);
}



CU_TestInfo USBD_MacroTests[] =
{

    {"Get maximum value", MACRO_USBD_Maximum},
    {"Get minimum value", MACRO_USBD_Minimum},
    {"Enable/Disable USB", MACRO_USBD_ENABLE_DISABLE_USB},
    {"Enable/Disable USB PHY", MACRO_USBD_ENABLE_DISABLE_PHY},
    {"Set/Clear USB DRVSE0 bit", MACRO_USBD_SET_CLEAR_SE0},
    {"Set/Get USB device address", MACRO_USBD_SET_GET_ADDR},
    {"Enable USBD interrupt function", MACRO_USBD_ENABLE_INT},
    {"Get/Clear USB interrupt flag", MACRO_USBD_GET_CLR_INT_FLAG},
    {"Get/Clear USB endpoint interrupt flag", MACRO_USBD_GET_CLR_EP_INT_FLAG},
    {"Get USB endpoint status", MACRO_USBD_GET_EP_FLAG},
    {"Get USB bus state", MACRO_USBD_GET_BUS_STATE},
    {"Get USB bus connection state", MACRO_USBD_IS_ATTACHED},
    {"Stop USB transaction", MACRO_USBD_STOP_TRANSACTION},
    {"Set data sequence synchronization", MACRO_USBD_SET_DATA0_DATA1},
    {"Set/Get USB payload size", MACRO_USBD_SET_GET_PAYLOAD_LEN},
    {"Configure endpoint", MACRO_USBD_CONFIG_EP},
    {"Set/Get endpoint buffer address", MACRO_USBD_SET_GET_EP_BUF_ADDR},
    {"Set/Clear/Get STALL state of the specified endpoint ID", MACRO_USBD_SET_CLR_GET_EP_STALL},
    {"Set/Get buffer mode of the specified endpoint ID", MACRO_USBD_SET_DB_SB_MODE_IS_DB_MODE},
    {"Set to active/inactive double buffer mode of the specified endpoint ID", MACRO_USBD_SET_DB_ACTIVE_INACTIVE},
    {"Memory copy test", MACRO_USBD_MemCopy},
    {"Set/Clear/Get STALL", MACRO_USBD_SetStall_ClearStall_GetStall},

    CU_TEST_INFO_NULL
};

CU_TestInfo USBD_ApiTests[] =
{

    {"USB open", API_USBD_Open},
    {"USB device start", API_USBD_Start},
    {"Get SETUP packet", API_USBD_GetSetupPacket},
    {"Process USB SETUP packet", API_USBD_ProcessSetupPacket},
    {"USB control IN test", API_USBD_CtrlIn},
    {"USB control OUT test", API_USBD_CtrlOut},
    {"USB software reset", API_USBD_SwReset},
    {"Set USBD vendor request callback function", API_USBD_SetVendorRequest},
    {"Set USBD callback function for SET_CONFIGURATION request", API_USBD_SetConfigCallback},
    {"Lock endpoint to avoid stall clear", API_USBD_LockEpStall},

    CU_TEST_INFO_NULL
};

CU_TestInfo USBD_ConstantTest[] =
{
    {"Endpoint ID constant test", CONST_USBD_Constants},

    CU_TEST_INFO_NULL
};
